trailcurrentoss/TrailCurrentFluidCNCPendant/sdkconfig.defaults
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
# Target: ESP32-P4 (Waveshare ESP32-P4 WiFi6 Touch LCD 7B board)
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# Disabled XIP from PSRAM to allow large rodata (embedded images)
CONFIG_SPIRAM_XIP_FROM_PSRAM=n
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# LVGL configuration (matches Fireside baseline)
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=15
CONFIG_LV_CIRCLE_CACHE_SIZE=10
CONFIG_LV_LAYER_SIMPLE_BUF_SIZE=102400
CONFIG_LV_IMG_CACHE_DEF_SIZE=5
CONFIG_LV_GRAD_CACHE_DEF_SIZE=10240
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n

# Built-in LVGL Montserrat fonts — referenced as &lv_font_montserrat_XX from
# styles.c / screens.c when text_font uses uppercase "MONTSERRAT_XX" in EEZ Studio.
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y

# Disable demo features to reduce binary size
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_DEMO_MUSIC=n

CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Task WDT — ui_init() builds 10 screens with hundreds of widgets and runs ~6.5s
# on core 0; the default 5s timeout fires during boot. Bump to 15s.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# Default event loop ("sys_evt") task — ESP-Hosted WiFi event handlers call
# vfprintf, which is stack-hungry on RISC-V. The default 2304 B overflows by
# a few bytes early in boot. Fireside (native ESP32-S3 WiFi) gets away with
# the default; the P4 + ESP-Hosted path does not.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144

# ESP-Hosted WiFi support (ESP32-P4 has no native WiFi — bridged to ESP32-C6 slave)
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# ESP-Hosted SDIO configuration for the Waveshare ESP32-P4 WiFi6 Touch LCD 7B
# (default Slot 1 pins: CLK=18, CMD=19, D0=14, D1=15, D2=16, D3=17)
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y

# DO NOT enable CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM on this board.
#
# The problem it was reached for: the SDIO RX streaming double-buffer is
# allocated from internal DMA RAM, and when that pool runs dry
# sdio_rx_get_buffer() does not degrade — it hits a hard assert and panics:
#
#   assert failed: sdio_rx_get_buffer sdio_drv.c:953 (*buf)
#
# Moving those buffers to PSRAM (=y) does stop that assert, but it breaks
# the SDIO *transmit* path on this hardware. Measured 2026-08-01:
#
#   E H_SDIO_DRV: sdio_write_task: 0: Failed to send data: 258 54 54
#   E H_SDIO_DRV: Unrecoverable host sdio state
#   I os_wrapper_esp: Restarting host
#
# 258 is ESP_ERR_TIMEOUT. Writes time out, the driver declares the link
# unrecoverable and restarts the host — trading a crash every ~60 s for a
# restart every ~6 s, plus visibly stuttering jog motion because the
# transport stalls mid-stream. The option's own help text says to leave it
# disabled "when transport latency must be minimised"; a jog stream is
# exactly that case.
#
# Fix the RX starvation by leaving more internal DMA RAM free (below)
# instead of relocating the buffers.
# CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM is not set

# Internal-RAM headroom for the SDIO transport.
#
# Both knobs push general-purpose allocations out to PSRAM so the internal
# DMA-capable pool stays available for the transport, which cannot use
# anything else:
#   ALWAYSINTERNAL — allocations at or below this size go to internal RAM
#                    by default. Dropping 16 KiB -> 4 KiB sends the medium
#                    allocations (LVGL objects, WS buffers) to PSRAM.
#   RESERVE_INTERNAL — internal RAM held back exclusively for DMA-capable
#                    and internal-only requests. This is the pool
#                    sdio_rx_get_buffer() draws from.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# Leave WiFi IRAM room for LVGL
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
